[XComGame.UIArmory_Loadout]
[UIArmory_Loadout]
m_strInventoryLabels[eInvSlot_PsiAmp]=PSIAMP

[TheGift X2AbilityTemplate]
LocFriendlyName="<font color='#C08EDA'>The Gift</font>"
LocFlyOverText="<font color='#C08EDA'>The Gift</font>"
LocLongDescription="This soldier harbors an immense psionic potential within themself."
LocHelpText="This soldier harbors an immense psionic potential within themself."
LocPromotionPopupText="<Bullet/> This soldier gains power proportional to its psi offense stat on psionic attacks. <br/>"

[TheGift X2EffectTemplate]
LocFriendlyName="The Gift"

[PsionStaffSlot X2StaffSlotTemplate]
EmptyText="OPEN: PSION REQUIRED"
BonusEmptyText="Train psionic abilities."
BonusDefaultText="PSION"
BonusText="%SKILL TRAINING"
FilledText="%UNITNAME is undergoing a serious of rigorous mental training exercises to strengthen their Psionic ability!"
LockedText="LOCKED: PURCHASE UPGRADE"